#Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт определения типа данных каждого элемента. Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
# Попробуйте использовать не только базовые типы, но и вложенные словари, кортежи, списки.
# (Можно ограничиться вложенностью 1 уровня и не обходить содержимое этих вложенных коллекций.)

list = [1, 96.5, 'vasya', (95, 'petya'), [1,67,34,13], {'name': 'Stas', 'location': 'SPb'}]

for i in range(len(list)):
    print(type(list[i]))

