# Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.
from sys import argv

def salary():
    return float(hours)*float(salary_per_hour) + float(bonus)

script_name, hours, salary_per_hour, bonus = argv

print(salary())
